Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Reunion.tmx
Source language: en
Languages: es_419

source: you should know very well by now that we do not meddle with matters beyond our duty.
es_419: ya deberías saber que no nos involucramos en asuntos más allá de nuestro deber.

source: so before you even start to make me look bad, think about why that is!
es_419: así que antes de hacerme sentir una traidora, ¡piensa por qué sucedió!

source: Feelings rekindle as secrets begin to unfold, Rhea soon realizes her childhood friend may not be who she believes him to be, and thus her most cherished relationship is put to the test.
es_419: Los sentimientos se reavivan a medida que los secretos comienzan a salir a la luz. Rhea pronto sospecha que su amigo de la infancia podría no ser la persona que ella cree y, por lo tanto, su relación más preciada se pone a prueba.

source: oh, i was a little surprised myself!
es_419: ¡sí, yo también estoy sorprendida!

source: n-no, he wasn’t. are you sure he isn’t back?
es_419: n-no. ¿estás seguro de que no volvió?

source: maybe i’m not cut out for the “high life” after all...
es_419: será que no merezco darme la "gran vida"…

source: i’m sorry for overstaying! i mean, s-staying over?
es_419: ¡perdón por haberme quedado hasta esta hora!

source: there’s something i’ve been meaning to ask you...
es_419: hay algo que quiero preguntarte hace tiempo…

source: oh great, so i’m an inconvenience to you now?
es_419: ¡ah, genial! ¿así que para ti soy un inconveniente?

source: no. you don’t know me.
es_419: no. tú no me conoces.

source: we’re not heroes, rhea, and we’re not people you want to be involved with.
es_419: no somos héroes, rhea. tampoco gente con la que quieras involucrarte.

source: what the- who the hell are you?!
es_419: ¡pero qué…! ¡¿quién diablos eres?!

source: hey, that’s the news about the incident from last night, right? did you hear?
es_419: es la noticia sobre el incidente de anoche, ¿no? ¿te enteraste?

source: so this old friend of yours... are you two close?
es_419: y él… ¿es un amigo cercano?

source: rhea, you’re not supposed to be here. did my dad let you in?
es_419: rhea, se supone que no deberías estar aquí. ¿mi papá te dejó entrar?

source: ooh...
es_419: aah…

source: don’t you know it’s rude to keep someone waiting for this long?
es_419: ¿no sabes que no es educado hacer esperar tanto a una persona?

source: we’ll try to find him, but you have to come with us right now, okay? you’re hurt too.
es_419: nos ocuparemos de él, pero ahora debe acompañarnos, ¿de acuerdo? usted también está herida.

source: sure, of course.
es_419: sí, por supuesto.

source: you knew that i saw you last night, are you seriously trying to pretend it didn’t happen?
es_419: sabes que anoche te vi, ¿en serio estás tratando de hacer como que no pasó nada?

source: he’s doing great, still loud, hard to miss. we’re housemates now, actually.
es_419: muy bien, escandaloso y extrovertido, como siempre. ahora compartimos casa.

source: deep down, i know it’s just easier to let them go than to watch them run when they know the truth.
es_419: en el fondo, sé que es más fácil dejar ir a esas personas que verlas salir huyendo cuando saben la verdad.

source: don’t put your friends in harm’s way, especially the ones you care about most.
es_419: no pongas a tus amigos en peligro, sobre todo a los que más quieres.

source: i know you!
es_419: ¡te conozco!

source: right. sorry, you could’ve woken me, i wouldn’t have minded.
es_419: ah, lo siento. me hubieras despertado, no me molesta.

source: you’ve changed too, rhea.
es_419: tú también cambiaste.

source: anyway, we should get going.
es_419: bien, deberíamos irnos.

source: but... that man...
es_419: pero… ese hombre…

source: sure...
es_419: claro…

source: please get in and sit tight.
es_419: entre ahí y siéntese.

source: you’re hurt! a-are you okay?!
es_419: ¡te hirieron! ¿estás bien?

source: i’m sorry, but i can’t wait around for nothing!
es_419: lo siento, ¡no voy a quedarme solo porque sí!

source: yeah, that’s the spirit!
es_419: ¡sí, esa es la actitud!

source: the victim, a 16 year-old male, was walking home from a party when he was threatened and wounded from a gunshot.
es_419: "la víctima, un joven de 16 años, se dirigía a su casa después de una fiesta cuando fue amenazado y herido de bala".

source: w-wait, what do you mean-
es_419: a-aguarda, ¿qué quieres de…?

source: it is, it was! it’s just...
es_419: ¡y así es! es solo que…

source: your family are the vigilantes.
es_419: se trata de tu familia.

source: officials urge citizens to avoid leaving the house at night and encourage travelling in groups to lower the chances of being targeted...
es_419: "las autoridades recomiendan a los ciudadanos no salir de noche y les sugieren trasladarse en grupos para reducir las posibilidades de ser atacados"…

source: what if... you knew someone, like the “anti-heroes” people are talking about, would you...avoid them?
es_419: digo, si conocieras a uno de los "antihéroes" de los que hablan, ¿te… alejarías?

source: most of them make sense, but sometimes doing the right thing requires you to bend the rules a little.
es_419: la mayoría tienen sentido, pero a veces hay que cambiarlas un poco para hacer lo correcto.

source: besides, you’re clearly in very good hands.
es_419: además, es obvio que estabas en buenas manos.

source: his mum does my hair all the time. in exchange, i have to make sure he eats his vegetables, i think.
es_419: su madre es quien me peina. a cambio, me pide que me asegure de que él coma verduras.

source: d-don’t say it like that...
es_419: n-no lo digas de ese modo…

source: yeah... you’re right.
es_419: sí, tienes razón.

source: i wouldn’t bore you with the details, really.
es_419: no te aburriré con los detalles.

source: somebody help me!
es_419: ¡que alguien me ayude!

source: you look like you could use some vitamin c
es_419: te vendría bien un poco de vitamina c.

source: okay, okay, we’ll do our best-
es_419: bien, haremos lo que podamos…

source: ay man, didn’t hear you come in, when did you get back?
es_419: eh, viejo, no te escuché entrar, ¿cuándo volviste?

source: when i placed my arm around him....
es_419: cuando lo abracé…

source: guess i’ll just leave this here then...
es_419: entonces la dejaré aquí…

source: are you just visiting? i thought you left the city for good.
es_419: ¿estás de visita? creí que te habías ido de la ciudad para siempre.

source: b-but!
es_419: ¡p-pero…!

source: bruh, and you were not kidding when you said she is cute now!
es_419: amigo, ¡no bromeabas cuando dijiste que ahora es preciosa!

source: you’re ALWAYS busy, but he was here the minute i called him. he’d drop everything to be here with me, but you?
es_419: siempre estás ocupado, pero él vino corriendo cuando lo llamé. dejaría todo para estar conmigo, ¿y tú?

source: i belong to a family of vigilantes.
es_419: somos una familia de justicieros.

source: where are you?
es_419: ¿dónde estás?

source: um, i don’t really know how to say this, but i think i bumped into him last night and saw he got into an accident...
es_419: eh, no sé muy bien cómo decir esto, pero creo que me crucé con él anoche y vi que tuvo un accidente…

source: but the way i see it, they wouldn’t exist if there wasn’t a need for them in the first place.
es_419: pero mi opinión es que no existirían si no fueran necesarios.

source: can’t tell if she’s serious, though.
es_419: pero no sé si lo dice en serio.

source: a man his age, with that build, why would he be tired all the time unless he is spending all his energy with another girl?!
es_419: un hombre joven y en buen estado físico ¿por qué estaría siempre cansado? ¡la única explicación es que gastara su energía con otra!

source: involving innocent civilians in our family’s business is not ideal, regardless of what they may mean to you.
es_419: es mala idea involucrar a civiles inocentes en los negocios familiares, más allá de lo que signifiquen para ti.

source: aw man, why am i always the side character?
es_419: ¿por qué siempre soy el personaje secundario?

source: hm...?
es_419: ¿mm?

source: don’t worry, it’s a simple job.
es_419: no te preocupes, solo es trabajo.

source: i can’t hold it in any longer.
es_419: ya no me aguanto.

source: yeah, so i knew something was up.
es_419: sí. entonces supe que pasaba algo.

source: so do you like what you do?
es_419: ¿y te gusta hacer eso?

source: hey!
es_419: ¡oye!

source: i should’ve left after the movie!
es_419: ¡debí irme después de la película!

source: get some rest. i’ll talk to you soon. see ya.
es_419: descansa. te llamaré pronto. adiós.

source: ...huh?
es_419: ¿mm?

source: there’s the little girl that came with you. she’s doing fine, and we also managed to reunite her with her father.
es_419: solo a la niña que vino contigo. ella está bien y ya se ha encontrado con su padre.

source: i can visit you?
es_419: ¿puedo visitarte?

source: and why is that?
es_419: ¿y por qué?

source: duh, i’m literally talking to you. why are you calling at this hour?
es_419: estoy hablando contigo, ¿no? ¿por qué llamas a esta hora?

source: i wanna return the shirt i borrowed. i swear it’s squeaky clean this time!
es_419: te devuelvo la camisa que me prestaste. ¡juro que esta vez está limpia!

source: listen, did shiro come home last night?
es_419: escucha, ¿shiro regresó a casa anoche?

source: i just wanted to make sure you’re fine.
es_419: solo quiero saber cómo estás.

source: yeah, don’t sweat it! i think you’re alright.
es_419: ¡lo sé, no te preocupes! creo que eres buen tipo.

source: and you... hisao.
es_419: y tú, hisao.

source: that’s you, isn’t it?
es_419: son ustedes, ¿verdad?

source: wait, what do you mean “supposed to”?
es_419: espera, ¿qué quieres decir con "se supone"?

source: A bystander claims that the two victims were rescued just in time by a mysterious man dressed in black, who disappeared as soon as help arrived.
es_419: "un transeúnte afirma que las víctimas fueron rescatadas justo a tiempo por un hombre misterioso vestido de negro, que desapareció cuando llegó la ayuda".

source: who is that?
es_419: ¿quién es?

source: i...forgot. it wasn’t important, i guess...
es_419: l-lo olvidé. supongo que no era importante…

source: you fell asleep again.
es_419: te volviste a dormir.

source: yeah. sure.
es_419: sí, claro.

source: guess i’ll just pretend i didn’t hear anything.
es_419: haré como que no escuché nada.

source: i’m going to tell her...
es_419: le diré…

source: what about the man?
es_419: ¿y el hombre?

source: so let me get this straight...
es_419: a ver si lo estoy entendiendo…

source: god forbid anyone have a bad hair day under her roof, you’ll never hear the end of it!
es_419: que el cielo no permita que alguien vaya a su casa despeinado, ¡no para de quejarse!

source: a nurse will be with you soon.
es_419: pronto vendrá una enfermera.

source: no, i’m not seeing anyone... not anymore.
es_419: no, ya no salgo con nadie.

source: i hope you’re not in a hurry, cuz i have a few questions about a man i was seeing...
es_419: ojalá no estés apurada, porque tengo varias preguntas sobre el hombre con el que salía…

source: though... it’s just me this time. i wasn’t sure if i was going to stick around, if i’m being honest.
es_419: aunque… esta vez estoy sola. para ser sincera, no estaba segura de si me quedaría.

source: she deserves to know.
es_419: merece saber.

source: that’s what you thought all this time?
es_419: ¿eso es lo que creías?

source: i thought things would start looking up by now, but...
es_419: creí que las cosas mejorarían, pero…

source: he’s there for me.
es_419: él siempre está.

source: guess you can’t trust me with one.
es_419: no soy confiable cuando uso uno.

source: the writing on this jacket... it’s your family name, isn’t it?
es_419: la escritura en la chaqueta… es tu apellido, ¿verdad?

source: oh!
es_419: ¡ah!

source: oh, someone’s here?
es_419: oh, ¿hay alguien?

source: look, people change. i know you two are childhood friends or whatever, but if you weren’t so hopelessly sentimental, maybe you can gain a better perspective.
es_419: mira, la gente cambia. sé que son amigos de la infancia, o lo que sea, pero si no fueras tan ridículamente emocional, te darías cuenta de cómo son las cosas.

source: i got your text and still and came to see you as soon as i could-
es_419: recibí tu mensaje y vine a verte tan pronto como pude.

source: oh no, it’s fine! but you were really tired, couldn’t you ask for a night off? maybe you could get some rest.
es_419: ¡oh, está bien! pero estás muy cansado, ¿no podrías pedir una noche libre? necesitas dormir.

source: the city is so different now. i know it hasn’t been too long, but i forgot how it was like being here and i was nervous for awhile.
es_419: la ciudad es muy diferente ahora. aún hace poco que llegué, pero había olvidado cómo era vivir aquí y me he sentido algo nerviosa.

source: i like who you’ve become.
es_419: … que me gusta quien eres ahora.

source: if he can run, he must be fine. help these other men first!
es_419: si puede correr, debe estar bien. ¡ayuden a estos primero!

source: ...and you appear to be the only one who has all the answers.
es_419: … y tú pareces ser la única que tiene todas las respuestas.

source: he kept giving me excuses, saying he has a lot on his plate, or that he needed time for himself.
es_419: siempre me daba excusas. decía que estaba ocupado o que necesitaba tiempo para hacer sus cosas.

source: but hey, since you were the one dating him, shouldn’t you know him better than i do?
es_419: pero, oye, tú eras la que salía con él, ¿no deberías conocerlo mejor que yo?

source: it depends. some people think that’s the safer thing to do. you won’t put your life at risk, and sometimes...
es_419: depende. algunas personas creen que es lo más seguro. no arriesgas tu vida y, a veces…

source: alright, let’s catch them quickly.
es_419: bien, atrapémoslas rápido.

source: i know that, but...
es_419: lo sé, pero…

source: hey, these girls are a pain, don’t you think so?
es_419: oye, estas chicas son un fastidio, ¿no crees?

source: i wish i’d known sooner.
es_419: ojalá lo hubiera sabido antes.

source: trust me. he’s not worth it.
es_419: créeme. no vale la pena.

source: you are not fit to carry out your duties. you need more training.
es_419: … no eres apto para cumplir con tus deberes. necesitas más entrenamiento.

source: you’re not who you used to be, you’re better, and i think i’d like to get to know you all over again.
es_419: no eres quien eras, eres mejor, y creo que me gustaría volver a conocerte.

source: OH THANK GOD.
es_419: uf, menos mal.

source: ay, wait!
es_419: ¡eh, espera!

source: but... you’re my old man.
es_419: pero… tú eres mi viejo.

source: those two have been in there for awhile.
es_419: han estado ahí un buen rato.

source: ...he’s not here anymore.
es_419: ya no existe.

source: so... are you gonna tell her or nah?
es_419: entonces… ¿se lo dirás o no?

source: i see.
es_419: ya veo.

source: that is all. you are dismissed.
es_419: eso es todo. pueden irse.

source: i-i got a call from rhea this morning, then i checked the news and saw the incident last night and you didn’t come home and i should’ve called to check but i was so tired so i went to bed instead-
es_419: r-rhea me llamó esta mañana y vi las noticias y salió el incidente de anoche y no volviste a casa y debería haberte llamado para saber qué pasaba, pero estaba tan cansado que me fui a dormir…

source: shiro, i’m sure you know what we need to talk about.
es_419: shiro, seguro sabes de qué tenemos que hablar.

source: it’s not what it looks like...
es_419: no es lo que parece…

source: ...reporting another incident of gang violence...
es_419: "… informamos de otro incidente de violencia de pandillas…"

source: man, what i’d do to see them in action!
es_419: ¡haría cualquier cosa por verlos en acción!

source: of course not, that’s silly.
es_419: para nada, no te preocupes.

source: so you provide a service... at night?
es_419: entonces, ¿provees un servicio… nocturno?

source: REUNION
es_419: reencuentro

source: i don’t know what to tell you, rhea. apparently the hair thing runs in the family.
es_419: no sé qué decirte, rhea. parece que el asunto del cabello viene de familia.

source: oh you have got to be kidding me.
es_419: debes estar bromeando.

source: hmm?
es_419: ¿mmm?

source: don’t change the subject.
es_419: no cambies de tema.

source: After moving away for a decade, Rhea returns to the bustling city on her quest for independence.
es_419: Después de haber vivido lejos durante una década, Rhea regresa a la bulliciosa ciudad en su búsqueda de independencia.

source: i totally dig your hair by the way, what’s your secret?
es_419: por cierto, me encanta tu peinado, ¿cuál es tu secreto?

source: it’s been awhile since i last went on a date with anyone.
es_419: ha pasado tiempo desde la última vez que salí con alguien.

source: well, can’t help it. i guess my boy is really a man now.
es_419: bien, es la vida. supongo que mi muchacho ya es un hombre.

source: sorry, you’re not a good fit for our company.
es_419: lo siento, no eres la candidata idónea para nosotros.

source: hey,do you still have the photos from the last field trip we took together?
es_419: oye, ¿aún tienes las fotos de la última excursión que hicimos?

source: hey, so... are you and kori... good?
es_419: oye, y… kori y tú… ¿va todo bien?

source: you had the choice to come quietly with us, but you chose to make a fuss and now we’re in this mess...
es_419: pudiste venir calladita con nosotros, pero armaste un escándalo y ahora estamos en este lío…

source: and hey, maybe you can also get to know me?
es_419: y quizá tú también puedas conocerme a mí.

source: ART ASSISTANTS
es_419: asistentes de arte

source: so consider tonight as an early celebration to your new job! y’know, the one you’re about to get.
es_419: entonces, ¡esta noche haremos una celebración anticipada por tu nuevo trabajo! ya casi lo consigues.

source: it involves doing dangerous tasks many won’t understand...
es_419: implica realizar actividades peligrosas que muchos no entienden…

source: not really...
es_419: en realidad, no…

source: OH. ah, my grandfather owns a business.
es_419: ah. bueno, mi abuelo tiene una empresa.

source: oh, someone is here.
es_419: ah, entró alguien.

source: i like who you are now, too.
es_419: ... también me gusta como eres ahora.

source: though, you’re pretty mysterious, you know that?
es_419: eres un poco misterioso, ¿lo sabías?

source: oh! just... nice people to hang out with?
es_419: bueno, gente agradable para pasar el rato.

source: r-really?
es_419: ¿e-en serio?

source: i tried my best...
es_419: hice lo que pude…

source: oh! i work here, but i guess i never told you that.
es_419: ¡ah! trabajo aquí, creo que no te lo dije.

source: geez, don’t worry, it’s just a scratch. besides, i was caught off guard!
es_419: cielos, no es más que un rasguño. además, ¡me tomaron por sorpresa!

source: wha- BAS!
es_419: ¿qué…? ¡bas!

source: i-i mean, you’ve seen the news, it’s not safe around here.{j}I’m just doing my part, don’t mention it.
es_419: d-digo, ya viste las noticias, no es seguro andar por aquí.{j}es lo correcto, no pasa nada.

source: wait, how so?
es_419: ¿sí? ¿cómo?

source: i just wish you’d asked me sooner.
es_419: ojalá me lo hubieras preguntado antes.

source: you had the choice to come quietly with us...
es_419: pudiste venir con nosotros tranquilita…

source: please understand, i have to go!
es_419: compréndame, ¡debo irme!

source: what about you then? last i remember, you didn’t even own a comb!
es_419: ¿y tú? ¡recuerdo que ni siquiera tenías peine!

source: i-i don’t know, he ran off-
es_419: n-no sé, salió corriendo…

source: that night, when i saw you again...
es_419: la noche que te volví a ver…

source: i tried to call you last night, where were you?
es_419: traté de llamarte anoche. ¿dónde estabas?

source: hey, shiro...
es_419: eh, shiro…

source: oh, it’s nothing.
es_419: ah, nada.

source: i-i mean, it’s okay if you’ve got other plans! i just thought it’d be great to catch up again after all these years!
es_419: q-quiero decir, ¡no hay problema si tienes otros planes! ¡pensé que sería genial ponernos al día después de tantos años!

source: how on earth do you keep your hair in shape? like, seriously, what’s your secret?
es_419: ¿cómo diablos mantienes tu cabello así? en serio, ¿cuál es tu secreto?

source: did he... protect us?
es_419: él… ¿nos protegió?

source: it’s just the three of us though...
es_419: aunque solo seremos nosotros tres…

source: aight, if you say so. hope you two will have a good night, then.
es_419: bueno, si tú lo dices… entonces, espero que pasen buena noche.

source: hm.
es_419: mm.

source: i see... well, that’s okay.
es_419: ah… ya veo.

source: no honey, i’m sure it has little to do with the weather...
es_419: no, cariño, estoy segura de que el tiempo no tiene nada que ver…

source: it’s fine, max. you haven’t seen your partner in ages, i can imagine why you’d be in a hurry to leave.
es_419: para nada, max. hace mucho que no ves a tu pareja. puedo imaginar por qué tienes apuro para partir.

source: i know your shift is over, but max is running a little late. mind holding the fort in the meantime?
es_419: sé que tu turno terminó, pero max está demorado. ¿podrías ocuparte mientras llega?

source: ah... i’ve been expecting you.
es_419: ah… al fin llegas.

source: yeah, an hour too late!
es_419: ¡una hora tarde!

source: ...getting involved can make matters worse.
es_419: … involucrarse puede empeorar las cosas.

source: yeah, i thought so too. so all the crimes you’ve been hearing about? apparently, they are being taken care of by these so called “fictional heroes.”
es_419: yo pensé lo mismo. entonces, ¿qué hay de todos los crímenes de los que hablan? aparentemente, estos "héroes ficticios" los están combatiendo.

source: suuuuure.
es_419: claaaaro.

source: ain’t no one tossing you a coin for being a white knight here, you bastard.
es_419: aquí nadie te dará dinero por actuar como un caballero andante, imbécil.

source: you just want grand kids, don’t you?
es_419: es porque quieres tener nietos, ¿no?

source: i’m glad we got here early, where should we start?
es_419: qué bien que llegamos temprano, ¿a dónde vamos?

source: it’s... it’s not that simple.
es_419: no es… tan simple.

source: your friend... who is he?
es_419: ¿quién es… él?

source: what... was that?
es_419: ¿qué… era?

source: why else are we together if you’re gonna be missing all the time?
es_419: ¿para qué estamos juntos si nunca estás conmigo?

source: everything else about him is... off.
es_419: todo él es… sospechoso.

source: shiro, are you blushing?
es_419: ¿te estás sonrojando?

source: look, those eyes...
es_419: mira sus ojos…

source: i could say the same to you.
es_419: yo podría decir lo mismo de ti.

source: so what are you doing out then? shouldn’t you be back home, too?
es_419: ¿y tú qué haces fuera? ¿no deberías haber vuelto a casa ya?

source: i guess this is my reality, and as much as i’ve wished for someone to understand...
es_419: supongo que es lo que me toca, y por mucho que desee que alguien lo comprenda…

source: cool!
es_419: ¡genial!

source: you just had to give my boys a hard time, didn’t you?
es_419: les hiciste pasar un mal rato a mis muchachos, ¿eh?

source: you’re not listening-
es_419: no me estás escuchando…

source: so let me guess, you were out late last night. work stuff again?
es_419: mm, déjame adivinar… anoche volviste tarde. ¿de nuevo el trabajo?

source: he’s not perfect, but he’s good. you can’t possibly think he’d hurt you like that, right?
es_419: no es perfecto, pero es una buena persona. ¿cómo puedes pensar que te lastimaría así?

source: ...seriously?
es_419: ¿de veras?
